[
  {
    "id": "kb-1",
    "content": "Bible360 is a chronological Bible reading plan comparison tool. It helps users compare different chronological reading plans from multiple sources including Blue Letter Bible, Logos Academic, BibleHub, and ESV.",
    "tags": ["about", "overview", "what is"],
    "metadata": { "category": "general" }
  },
  {
    "id": "kb-2",
    "content": "Bible360 offers 365-day chronological Bible reading plans. Each plan takes you through the entire Bible in historical/chronological order rather than the traditional book order.",
    "tags": ["reading plan", "365 days", "chronological"],
    "metadata": { "category": "plans" }
  },
  {
    "id": "kb-3",
    "content": "The Blue Letter Bible reading plan is a 365-day chronological plan from Blue Letter Bible (blueletterbible.org). It includes combined readings for some books and spreads Revelation across the final 4 days.",
    "tags": ["blue letter bible", "blb", "provider"],
    "metadata": { "category": "providers" }
  },
  {
    "id": "kb-4",
    "content": "The Logos Academic reading plan is a 365-day chronological plan from Logos Bible Software (logos.com). It includes all epistles at their correct chronological positions with combined readings for shorter books.",
    "tags": ["logos", "logos academic", "provider"],
    "metadata": { "category": "providers" }
  },
  {
    "id": "kb-5",
    "content": "The BibleHub reading plan is a 365-day chronological plan from BibleHub.com. It includes Paul's commentary on key passages with theological insights.",
    "tags": ["biblehub", "provider", "commentary"],
    "metadata": { "category": "providers" }
  },
  {
    "id": "kb-6",
    "content": "Chronological Bible reading means reading the Bible in the order events actually happened historically, rather than in the order of books as they appear in the Bible. For example, Job is read after Genesis 11 because Job lived during the patriarchal period.",
    "tags": ["chronological", "order", "how it works"],
    "metadata": { "category": "explanation" }
  },
  {
    "id": "kb-7",
    "content": "Each daily reading in Bible360 includes the passage reference, historical context, approximate date, and a description of the theological significance of that reading.",
    "tags": ["daily reading", "features", "context"],
    "metadata": { "category": "features" }
  },
  {
    "id": "kb-8",
    "content": "The New Testament readings in the chronological plan are placed in their historical order. James is read early (around Acts 13-14) because it was written around AD 45-48, making it one of the earliest NT books.",
    "tags": ["new testament", "james", "chronology", "epistles"],
    "metadata": { "category": "nt" }
  },
  {
    "id": "kb-9",
    "content": "Revelation is always the final book in chronological plans, dated around AD 95 during the reign of Domitian. Bible360 plans spread Revelation across 4 days (chapters 1-5, 6-11, 12-18, 19-22) for better pacing.",
    "tags": ["revelation", "apocalypse", "end times"],
    "metadata": { "category": "revelation" }
  },
  {
    "id": "kb-10",
    "content": "Bible360 is built with SvelteKit and deployed as a static site. It's open source and available on GitHub at github.com/pokho/Bible360.",
    "tags": ["github", "open source", "technology"],
    "metadata": { "category": "technical" }
  },
  {
    "id": "kb-11",
    "content": "To use Bible360, simply visit bible360.net and select a reading plan from the available providers. Click on any day to see the readings and historical context. You can compare plans side by side.",
    "tags": ["how to use", "getting started", "tutorial"],
    "metadata": { "category": "usage" }
  },
  {
    "id": "kb-12",
    "content": "The Apocrypha reading plan includes deuterocanonical books like Tobit, Judith, Wisdom, Sirach, Baruch, and 1-2 Maccabees, read in their historical context.",
    "tags": ["apocrypha", "deuterocanonical", "catholic"],
    "metadata": { "category": "apocrypha" }
  },
  {
    "id": "kb-13",
    "content": "Primeval History (Before 4000 BC - c. 2000 BC): The earliest period of biblical history covering Creation, the Fall of Adam and Eve, Cain and Abel, the genealogies from Adam to Noah, the Great Flood, and the Tower of Babel. Key books: Genesis 1-11. This period shows God's original perfect creation, humanity's fall into sin, and God's judgment and grace.",
    "tags": ["historical period", "primeval", "creation", "flood", "genesis"],
    "metadata": { "category": "historical-periods", "priority": 3 }
  },
  {
    "id": "kb-14",
    "content": "Patriarchal Era (c. 2100-1800 BC): The age of Israel's founding fathers - Abraham, Isaac, Jacob, and Joseph. God established His covenant with Abraham, promising land, descendants, and blessing to all nations. Job also lived during this period. Key events: Abraham's call, Sodom and Gomorrah, binding of Isaac, Jacob's dreams, Joseph in Egypt. Books: Genesis 12-50, Job.",
    "tags": ["historical period", "patriarchs", "abraham", "jacob", "joseph", "job"],
    "metadata": { "category": "historical-periods", "priority": 3 }
  },
  {
    "id": "kb-15",
    "content": "Exodus and Law (c. 1445-1400 BC): God delivered Israel from Egyptian slavery through Moses, culminating in the Passover and crossing of the Red Sea. At Mount Sinai, God gave the Law (Ten Commandments) and instructions for the Tabernacle. Books: Exodus, Leviticus. This period established Israel as God's covenant nation.",
    "tags": ["historical period", "exodus", "moses", "law", "sinai", "tabernacle"],
    "metadata": { "category": "historical-periods", "priority": 3 }
  },
  {
    "id": "kb-16",
    "content": "Wilderness Wanderings (c. 1400-1350 BC): After refusing to enter the Promised Land due to fear, Israel wandered in the wilderness for 40 years. The entire generation of adults (except Joshua and Caleb) died. Key events: twelve spies, Korah's rebellion, bronze serpent, Balaam. Book: Numbers. This period taught Israel to trust God completely.",
    "tags": ["historical period", "wilderness", "numbers", "wanderings", "40 years"],
    "metadata": { "category": "historical-periods", "priority": 2 }
  },
  {
    "id": "kb-17",
    "content": "Conquest and Judges (c. 1350-1050 BC): Joshua led Israel to conquer Canaan, dividing the land among the twelve tribes. After Joshua's death, Israel entered a cycle of sin, oppression, repentance, and deliverance through judges like Deborah, Gideon, Samson, and Samuel. Books: Joshua, Judges, Ruth. This period shows the consequences of incomplete obedience.",
    "tags": ["historical period", "conquest", "judges", "joshua", "canaan", "gideon", "samson"],
    "metadata": { "category": "historical-periods", "priority": 3 }
  },
  {
    "id": "kb-18",
    "content": "United Monarchy (c. 1050-930 BC): Israel's golden age under three kings: Saul (first king), David (man after God's heart, established Jerusalem), and Solomon (built the Temple, renowned for wisdom). Israel was united as one kingdom. Psalms, Proverbs, and Song of Solomon were written during this era. Books: 1-2 Samuel, 1 Kings 1-11, 1 Chronicles, Psalms, Proverbs.",
    "tags": ["historical period", "united monarchy", "saul", "david", "solomon", "temple", "psalms"],
    "metadata": { "category": "historical-periods", "priority": 3 }
  },
  {
    "id": "kb-19",
    "content": "Divided Kingdom (c. 930-586 BC): After Solomon's death, Israel split into two kingdoms: Israel (north, 10 tribes, capital Samaria) and Judah (south, 2 tribes, capital Jerusalem). Israel fell to Assyria in 722 BC; Judah fell to Babylon in 586 BC. Prophets like Elijah, Elisha, Isaiah, and Jeremiah ministered during this turbulent period. Books: 1-2 Kings, 2 Chronicles, prophetic books.",
    "tags": ["historical period", "divided kingdom", "israel", "judah", "assyria", "babylon", "prophets"],
    "metadata": { "category": "historical-periods", "priority": 3 }
  },
  {
    "id": "kb-20",
    "content": "Exile and Return (c. 586-400 BC): Judah was exiled to Babylon for 70 years. After Persia conquered Babylon, Jews gradually returned in three waves under Zerubbabel, Ezra, and Nehemiah. They rebuilt the Temple (516 BC) and Jerusalem's walls (444 BC). Esther became queen in Persia. Books: Ezra, Nehemiah, Esther, Daniel, Ezekiel. Prophets: Haggai, Zechariah, Malachi.",
    "tags": ["historical period", "exile", "return", "babylon", "persia", "ezra", "nehemiah", "esther"],
    "metadata": { "category": "historical-periods", "priority": 3 }
  },
  {
    "id": "kb-21",
    "content": "Life of Christ (c. 4 BC - AD 30): Jesus Christ, the eternal Son of God, was born in Bethlehem, ministered for approximately 3 years, was crucified, and rose from the dead. Key events: incarnation, baptism, temptation, miracles, parables, crucifixion, resurrection, ascension. Books: Matthew, Mark, Luke, John. Jesus fulfilled Old Testament prophecies and established the New Covenant.",
    "tags": ["historical period", "life of christ", "jesus", "gospels", "resurrection", "new covenant"],
    "metadata": { "category": "historical-periods", "priority": 3 }
  },
  {
    "id": "kb-22",
    "content": "Early Church (c. AD 30-70): After Pentecost, the Holy Spirit empowered believers to spread the gospel from Jerusalem to Judea, Samaria, and the ends of the earth. Paul's missionary journeys established churches across the Roman Empire. Key events: Pentecost, Stephen's martyrdom, Paul's conversion, Jerusalem Council. Book: Acts. Letters from James, Paul, Peter began circulating.",
    "tags": ["historical period", "early church", "acts", "pentecost", "paul", "missionary journeys"],
    "metadata": { "category": "historical-periods", "priority": 3 }
  },
  {
    "id": "kb-23",
    "content": "Epistles Period (c. AD 45-95): Letters written to churches and individuals explaining Christian doctrine and practice. Paul wrote Romans through Philemon (c. 49-67 AD). General epistles (Hebrews through Jude) were written by various authors. These letters apply Christ's work to daily life and address theological issues. Reading order follows probable chronological writing sequence.",
    "tags": ["historical period", "epistles", "paul", "letters", "romans", "doctrine"],
    "metadata": { "category": "historical-periods", "priority": 2 }
  },
  {
    "id": "kb-24",
    "content": "Apocalypse (c. AD 95): The apostle John received the revelation of Jesus Christ while exiled on Patmos during Domitian's persecution. Revelation reveals Christ's ultimate victory, the final judgment, and the new heaven and new earth. It concludes the biblical narrative and canon. Key themes: worship, perseverance, Christ's return, God's sovereignty over history.",
    "tags": ["historical period", "apocalypse", "revelation", "john", "patmos", "end times", "new creation"],
    "metadata": { "category": "historical-periods", "priority": 2 }
  },
  {
    "id": "kb-25",
    "content": "Genesis Overview: The book of beginnings. Covers creation (chapters 1-2), the fall (chapter 3), the flood (chapters 6-9), and the patriarchs Abraham, Isaac, Jacob, and Joseph (chapters 12-50). Key themes: God as Creator, human sin, God's covenant promises, election, providence. Genesis establishes the foundation for understanding the entire Bible.",
    "tags": ["book overview", "genesis", "creation", "patriarchs", "covenant", "beginnings"],
    "metadata": { "category": "book-overviews", "priority": 3 }
  },
  {
    "id": "kb-26",
    "content": "Job Overview: The story of a righteous man who suffered greatly yet maintained his faith. Job lived during the patriarchal period (likely before Abraham). The book addresses the problem of evil and suffering, divine sovereignty, and human limitation. After extensive dialogue with friends and God's response, Job is humbled and restored. Key verse: 'Though he slay me, yet will I hope in him' (Job 13:15).",
    "tags": ["book overview", "job", "suffering", "sovereignty", "faith", "wisdom"],
    "metadata": { "category": "book-overviews", "priority": 2 }
  },
  {
    "id": "kb-27",
    "content": "Psalms Overview: The songbook of Israel, containing 150 psalms written by David, Asaph, the sons of Korah, Moses, Solomon, and others. Types include lament, praise, thanksgiving, royal, wisdom, and messianic psalms. Psalms expresses the full range of human emotion in relationship with God. Key psalms: 23 (Shepherd), 51 (Repentance), 119 (God's Word), 139 (God's omniscience).",
    "tags": ["book overview", "psalms", "david", "worship", "prayer", "songs", "emotion"],
    "metadata": { "category": "book-overviews", "priority": 3 }
  },
  {
    "id": "kb-28",
    "content": "Isaiah Overview: The 'fifth gospel' contains more messianic prophecies than any other prophetic book. Isaiah ministered in Judah from 740-700 BC, warning of judgment while promising future restoration through the Messiah. Key passages: Immanuel (7:14), Wonderful Counselor (9:6-7), Suffering Servant (chapter 53). Isaiah 53 describes Christ's substitutionary atonement in remarkable detail.",
    "tags": ["book overview", "isaiah", "messiah", "prophecy", "servant", "immanuel", "suffering servant"],
    "metadata": { "category": "book-overviews", "priority": 3 }
  },
  {
    "id": "kb-29",
    "content": "Revelation Overview: The final book reveals Jesus Christ in His glory and final victory. Written by John around AD 95 during persecution, it uses apocalyptic imagery to encourage faithfulness. Structure: Christ and the churches (1-3), throne room worship (4-5), seven seals, trumpets, bowls (6-16), Babylon's fall (17-18), Christ's return (19), final judgment (20), new creation (21-22). 'Behold, I am making all things new' (21:5).",
    "tags": ["book overview", "revelation", "apocalypse", "christ", "judgment", "new creation", "victory"],
    "metadata": { "category": "book-overviews", "priority": 3 }
  },
  {
    "id": "kb-30",
    "content": "What is chronological Bible reading? It means reading Scripture in the order events occurred historically rather than the traditional book arrangement. This helps readers understand the flow of redemptive history, see how prophecies relate to their fulfillment, and understand the cultural context. For example, Job is placed early (after Genesis 11) because he likely lived during the patriarchal period.",
    "tags": ["faq", "chronological", "order", "how it works", "explanation"],
    "metadata": { "category": "faq", "priority": 3 }
  },
  {
    "id": "kb-31",
    "content": "How are biblical dates determined? Scholars use internal biblical evidence (genealogies, reign lengths, cross-references) combined with external historical sources (Assyrian, Babylonian, Egyptian records). Conservative scholars generally date creation around 4000 BC, the Exodus around 1446 BC, and Solomon's temple around 966 BC. Some dates have uncertainty, especially for early events.",
    "tags": ["faq", "chronology", "dates", "dating", "how determined", "scholarship"],
    "metadata": { "category": "faq", "priority": 2 }
  },
  {
    "id": "kb-32",
    "content": "Why is Job placed early in chronological plans? Job likely lived during the patriarchal period (c. 2100-1800 BC) because: (1) he lived 140 years after his trial, consistent with pre-Mosaic lifespans; (2) his wealth was measured in livestock like the patriarchs; (3) he acted as priest for his family like Abraham and Job; (4) there's no mention of the Mosaic Law or tabernacle.",
    "tags": ["faq", "job", "placement", "chronology", "patriarchal", "early"],
    "metadata": { "category": "faq", "priority": 2 }
  },
  {
    "id": "kb-33",
    "content": "How do the four reading plan providers differ? Blue Letter Bible (BLB) follows a traditional evangelical chronology. Logos Academic uses scholarly resources from Logos Bible Software. BibleHub includes Paul's commentary with theological insights and typology. ESV provides the English Standard Version's chronological plan. All cover the entire Bible in 365 days but arrange some books differently.",
    "tags": ["faq", "providers", "difference", "blb", "logos", "biblehub", "esv"],
    "metadata": { "category": "faq", "priority": 2 }
  },
  {
    "id": "kb-34",
    "content": "What version should I read? Bible360 links to BibleHub which offers multiple translations. For study, consider: ESV (accurate, readable), NASB (formally equivalent), NIV (dynamic equivalence), KJV (traditional). The Passion Translation (TPT) offers devotional insights especially for poetic books. Reading multiple translations can deepen understanding.",
    "tags": ["faq", "translations", "versions", "esv", "niv", "nasb", "tpt"],
    "metadata": { "category": "faq", "priority": 1 }
  },
  {
    "id": "kb-35",
    "content": "Genealogy and Name Meanings (Adam to Jesus): The lineage from Adam to Christ reveals God's redemptive plan. Key Hebrew name meanings: Eve = LIFE-GIVER, Seth = SUBSTITUTE (replacing Abel), Enoch = DEDICATED to God, Noah = REST, Abraham = FATHER OF MANY, Isaac = HE LAUGHS, Jacob = HE DECEIVES (later Israel = HE STRUGGLES WITH GOD), Judah = PRAISE. David and Bathsheba (DAUGHTER-OF-AN-OATH) are in Christ's lineage (Matthew 1, Luke 3).",
    "tags": ["paul commentary", "genealogy", "names", "adam", "jesus", "lineage", "hebrew"],
    "metadata": { "category": "paul-commentary", "priority": 3 }
  },
  {
    "id": "kb-36",
    "content": "The Ark as a Type of Christ: Noah's ark prefigures Jesus Christ. (1) Only one door - Jesus said 'I am the door' (John 10:9). (2) The ark was the ONLY way of salvation from the flood - Jesus is the ONLY way to the Father (John 14:6). (3) The pitch covering (Hebrew 'kaphar') is the same word for ATONEMENT - Christ is our atonement covering us from judgment. (4) Inside the ark = safety; outside = destruction.",
    "tags": ["paul commentary", "typology", "ark", "christ", "noah", "salvation", "atonement"],
    "metadata": { "category": "paul-commentary", "priority": 3 }
  },
  {
    "id": "kb-37",
    "content": "Noah as a Type of Christ: Noah prefigures Christ in several ways. (1) Noah was 'righteous' and 'found favor' (grace) in God's eyes (Genesis 6:8-9), pointing to the truly Righteous One. (2) Through Noah, his family was saved from judgment; through Christ, His people are saved from divine wrath. (3) Noah's name means REST, and Jesus says 'Come to me...and I will give you rest' (Matthew 11:28).",
    "tags": ["paul commentary", "typology", "noah", "christ", "righteous", "salvation", "rest"],
    "metadata": { "category": "paul-commentary", "priority": 3 }
  },
  {
    "id": "kb-38",
    "content": "The Dove and Olive Branch: When the dove returned with an olive leaf (Genesis 8:11), it signaled new life after the flood judgment. This points to the Holy Spirit who descended 'like a dove' at Jesus' baptism (Matthew 3:16). Jesus is our peace (Ephesians 2:14) - the olive branch of reconciliation between God and humanity. The dove represents the Spirit bringing peace and new creation.",
    "tags": ["paul commentary", "typology", "dove", "olive branch", "holy spirit", "peace", "baptism"],
    "metadata": { "category": "paul-commentary", "priority": 2 }
  },
  {
    "id": "kb-39",
    "content": "The Rainbow Covenant: God established a covenant with Noah using the rainbow as its sign (Genesis 9:12-17), promising never to destroy the earth with a flood again. This covenant points forward to the New Covenant in Christ's blood (Luke 22:20) - a promise of eternal salvation rather than destruction. Every rainbow reminds us of God's faithfulness and points to His ultimate promise in Christ.",
    "tags": ["paul commentary", "covenant", "rainbow", "noah", "new covenant", "promise", "faithfulness"],
    "metadata": { "category": "paul-commentary", "priority": 2 }
  },
  {
    "id": "kb-40",
    "content": "Flood and Baptism: 1 Peter 3:20-21 explicitly connects the flood to Christian baptism: 'In the days of Noah...eight souls were saved through water. There is also an antitype which now saves us - baptism.' The flood waters symbolize baptism into Christ's death and resurrection - the ultimate washing that brings salvation. As Noah passed through the waters of judgment to a new world, believers pass through baptism into new life.",
    "tags": ["paul commentary", "flood", "baptism", "1 peter", "salvation", "new life", "resurrection"],
    "metadata": { "category": "paul-commentary", "priority": 3 }
  },
  {
    "id": "kb-41",
    "content": "Romans 11:36 - All Things in Christ: 'For from Him and through Him and to Him are all things.' This verse captures the cosmic reality that everything is FROM Christ, THROUGH Christ, and FOR Christ. All things originate from Him, exist through Him, and find their purpose and completion in Him. John 1:1-3 parallels Genesis 1:1 - the Word who became flesh is the eternal Son present at creation, through whom all things were made (Colossians 1:16-17).",
    "tags": ["paul commentary", "romans", "christ", "creation", "sovereignty", "purpose", "cosmic"],
    "metadata": { "category": "paul-commentary", "priority": 3 }
  },
  {
    "id": "kb-42",
    "content": "TPT Recommendation for Genesis: The Passion Translation (TPT) version of Genesis is highly recommended, especially chapter 2, which beautifully portrays the intimacy of God's relationship with humanity. TPT brings out devotional and emotional dimensions that complement more literal translations. It's particularly helpful for devotional reading alongside study Bibles like ESV or NASB.",
    "tags": ["paul commentary", "tpt", "translation", "genesis", "devotional", "intimacy"],
    "metadata": { "category": "paul-commentary", "priority": 2 }
  },
  {
    "id": "kb-43",
    "content": "John 1 and Genesis 1 Connection: John 1:1 ('In the beginning was the Word') parallels Genesis 1:1 ('In the beginning God created'). The Word who became flesh (John 1:14) is the eternal Son, present at creation, through whom all things were made (John 1:3, Colossians 1:16-17). When Genesis speaks of God creating, judging, and covenanting, we are seeing the triune God at work, with the Son as the divine agent of creation and redemption.",
    "tags": ["paul commentary", "john", "genesis", "word", "christ", "creation", "trinity"],
    "metadata": { "category": "paul-commentary", "priority": 2 }
  },
  {
    "id": "kb-44",
    "content": "Biblical Chronology Disclaimer: Biblical chronology involves some uncertainty, especially for early events. Scholars use genealogies, archaeological evidence, and ancient records to estimate dates. Conservative scholars generally agree on the overall timeline but may differ on specific dates. Bible360 presents dates based on conservative evangelical scholarship while acknowledging the inherent limitations of ancient dating methods.",
    "tags": ["faq", "chronology", "uncertainty", "scholarship", "dating", "limitations"],
    "metadata": { "category": "faq", "priority": 1 }
  }
]
